{
  "press": [
    {
      "snippet": "The week's best new music: \"(Red Pine) is a bittersweet little indie song covering all the important parts of life: 69ing, abstaining from weed, saying goodbye\"- Keith Harris, Racket",
      "readMoreUrl": "https://racketmn.com/its-time-again-for-the-weeks-best-new-music-and-its-worst"
    },
    {
      "snippet": "\"A project which looks to evoke those private moments of contemplation and small comforts, be they born of wallowing or self-care\" –Jon Doyle and Liam Doyle, Various Small Flames",
      "readMoreUrl": "https://varioussmallflames.co.uk/2024/02/06/weekly-listening-february-2024-1/"
    },
    {
      "snippet": "“Gorgeous vocals and some guitar work with a bit of a Big Thief quality that expands and delights with an emotional sensitivity.” –Will Oliver, We all want someone to shout for",
      "readMoreUrl": "https://weallwantsomeone.org/2024/02/24/bathtub-cig-red-pine/"
    },
    {
      "snippet": "“The seamless combination of musical elements and the captivating lyrics make this song (Red Pine) an exceptional piece of art.” –Filip Zemcik, Start Track",
      "readMoreUrl": "https://start-track.com/single-bathtub-cig-red-pine/"
    },
    {
      "snippet": "“Night Blindness is a Gen Z ode to challenges of being a 20 something, and puts some of our hardest thoughts into music. It’s a big step forward in the band’s nascent career and invites listeners to join them on their journey to inevitable success.” -Mpls/St Paul editors, MPLS St Paul Magazine",
      "readMoreUrl": "https://mspmag.com/arts-and-culture/essential-minnesota-albums-from-2022/"
    },
    {
      "snippet": "“When taking notes about “Night Blindness” two words kept popping up: clever and dark… The whole EP is chill but not quite laid back. The lyricism is witty and quite a few times brought a smirk to my face.”-Andrew Perrizo, Melodic Noise Newsletter",
      "readMoreUrl": "https://melodicnoisemedia.com/reviews/fav-eps-of-2022/"
    },
    {
      "snippet": "“Bathtub cig is the best kind of bedroom pop, soft and sweet with lyrics that hit you hard…” -DJ lil witch, WKNC 88.1",
      "readMoreUrl": "https://wknc.org/2021/06/28/bathtub-cig-bed-review/"
    },
    {
      "snippet": "The Current 89.3 interview on “bed”",
      "readMoreUrl": "https://www.thecurrent.org/feature/2021/05/14/bathtub-cig-hilary-james-meet"
    },
    {
      "snippet": "“Old Light… brims with earnest, reflective lyrics and sunny instrumentation.  It’s a sound that contacts starkly with soul-wearying isolation of depression.”- Erica Rivera, City Pages Picked to Click",
      "readMoreUrl": "http://www.citypages.com/music/picked-to-click-2018-no-6-bathtub-cig/497721641"
    },
    {
      "snippet": "“James has an ear for sweet melodies that build worlds out of everyday minutiae, with dark undertones at times.”- Peter Diamond, City Pages",
      "readMoreUrl": "http://www.citypages.com/music/bathtub-cig-form-a-therapeutic-pop-supergroup-for-their-new-ep-old-light/486557211"
    }
  ]
}
